# Задача 4:
# Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# Данная задача бутет верна , только при условии ввода четного числа
# значением более 4.

S = int(input())
Kat = S // 2
Piter = Kat // 2
Serj = Piter
print(Kat, Piter, Serj)

# Понимаю что переменные с заглавных букв , но пока требований не предявляли ).
# И все понятно ).
