# Задача 2
# Найдите сумму цифр трехзначного числа.


n = (input())
num_1 = int(n[0])
num_2 = int(n[1])
num_3 = int(n[2])
print(num_1 + num_2 + num_3)
