
# Вагоны в электричке пронумерованы общественностью
# сантехника с 1 (при этом иногда вагоны нумеруются от «головы» поезда,
# а иногда – с «хвоста»; это зависит от того,
# в какую сторону едет электричка).
# В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и наблюдения,
# что его вагон имеет номер j. Он хочет определить,
# количество всего вагонов в электричке. Напишите программу,
# который будет это делать или сообщать,
# что без дополнительной информации это сделать невозможно.
# Ввод: 3 4(ввод на разных строках)
# Выход: 6

vitya_num = int(input())
train_num = int(input())
if vitya_num == train_num:
    print('без дополнительной информации это сделать невозможно')
else:
    print(vitya_num + train_num - 1)