
# В некоторых случаях решили выбрать три новых математических
# класса и оборудовать кабинеты для них добавленными партами.
# За каждой партой могут сидеть два ученика.
# Известное количество учащихся в каждом из трех классов.
# Выведите наименьшее число частей, которые необходимы для их приобретения.
# Ввод: 20 21 22(ввод чисел НЕ в одну строку)
# Выход: 32

firs_cl  =  21
second_cl  =  21
third_cl  =  21
print ((firs_cl  +  1 ) //  2  +
      ( second_cl  +  1 ) //  2  +
      ( third_cl  +  1 ) //  2 )
